<link rel="stylesheet" href="/static/css/lgb/title.css"/>
<section>
    <p class="title3">
        <span style="margin-left: 35%;">服务推广协议</span>
    </p>
    <div class="main">
       <P>甲方：青岛零工在线信息技术有限公司 <br/>
           乙方：<br/>
           为更好的服务于用户，让更多的用户便捷地找到所需的零工服务。
           现青岛零工在线信息技术有限公司在全国范围内开展“挣零工币兑换实物或现金”活动。
           经甲方同意，授权乙方进行项目推广，双方协议如下：<br/>
           第一条：服务推广条件 <br/>
           1、乙方必须是经零工在线（www.lg-zx.com）网站注册会员；<br/>
           2、乙方应为中华人民共和国公民，具有完全民事行为能力；<br/>
           3、乙方须具备经营管理能力及良好的社会信誉，无犯罪记录；<br/>
           4、乙方须具备手机等与甲方进行交流的信息平台；<br/>
           5、乙方必须是自愿从事服务推广活动。<br/>
           第二条：服务推广资格的获取<br/>
           1、正确填写“我要推广”项目内容并提交甲方；<br/>
           2、经甲方审核批准后获得推荐人唯一工号或链接ID；<br/>
           3、每个地市限100个签约人。<br/>
           第三条：零工币获取方式<br/>
           通过乙方推荐的零工，每推荐一个个人套餐型客户提10个零工币，
           推荐一个公司套餐型客户提20个零工币，推荐一个其他金额型客户提2个零工币。零工币按每次充值提取。
           严禁乙方以各种方式骗取零工币。<br/>
           第四条：兑换条件<br/>
           1、零工币累计记满10个零工币或满三个月即可申请兑换，零工币可兑换同等价值的实物或现金；<br/>
           2、满足上述兑换条件的零工币，乙方可以选择在授权期内一次性兑换也可在授权期内分次兑换，
           一经兑换相应的工分清零；<br/>
           3、零工币须在授权期内及时兑换；授权期满，协议终止之后获取的零工币不予兑换。<br/>
           第五条：服务推广授权期限<br/>
           服务推广期限为一年，自本协议签订之日起计算。<br/>
           第六条：甲方权利义务<br/>
           1、在本协议有效期内，甲方有权授予乙方服务推广人员资格，允许乙方使用甲方产品项目的推广及服务；<br/>
           2、甲方有权依据本协议对乙方的服务推广活动进行监督及业务指导，对乙方存在的违约问题，甲方有权要求乙方限期整改，
           若情节严重的，甲方有权终止乙方服务推广资格，若乙方未按照甲方的要求进行服务推广活动而给甲方造成损失的，
           甲方有权追究乙方的法律责任；<br/>
           3、协议有效期内，甲方允许乙方查询获取工分明细；<br/>
           4、对满足兑换条件的零工币，甲方按照协议约定积极为乙方进行零工币兑换。<br/>
           第七条：乙方权利义务<br/>
           1、乙方享有获得相关推广及服务奖励的权利；<br/>
           2、乙方有查询工分获取明细的权利，乙方可在其零工宝内查询与其ID绑定的通过乙方的推广
           而注册的会员的状态信息（仅限登录名、是否实名、是否有效帐号、是否充值）；<br/>
           3、乙方在授权范围内开展推广活动，应自觉维护甲方及相关企业形象，守法经营，
           不得损害甲方及相关企业信誉。乙方必须严格按照相关法律法规的规定，正确宣传零工在线。<br/>
           第八条：违约责任
           若乙方不正当的利用平台散布非法信息、损害商誉、使用虚假信息刷工分等情况时，一经发现，
           甲方将给以扣除其全部工分、取消推广资格或不予注册等处罚。严重的，甲方保留诉诸法院的权利。<br/>
           第九条 其它条款<br/>
           1、如果发生有关本协议的争议，甲、乙双方应友好协商解决，协商不成时，由甲方住所地的人民法院管辖；<br/>
           2、本协议一式两份，甲乙方各执一份。<br/>

           甲方：青岛零工在线信息技术有限公司<br/>
           授权人：<br/>
           签约日期： </P>
    </div>
</section>
<style>
    div.main{
        margin-top: 2rem;
    }
    div.main p{
        margin: 1.5rem;
        text-align: left;
        line-height: 2rem;
        font-size: 1.2rem;
    }
</style>
