<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <link rel="stylesheet" href="/static/css/common.css"/>
    <link rel="stylesheet" href="/static/css/head-foot.css"/>
    <link rel="stylesheet" href="/static/css/help.css"/>
    <title>帮助中心</title>
</head>
<body>
<section>
    <div class="head">
        <img src="/static/images/LOGOa.png" alt=""/>
        <span>帮助中心</span>
    </div>
</section>
<p class="line"></p>
<section>
  <div class="main">
          <p class="h1">注册会员</p>
          <p class="h2">客户为什么要注册会员？</p>
          <p class="h3">
              客户（个人类型、公司类型）发布在零工在线的信息，应严格遵守国家相关的法律法规和《零工在线用户协议》，注册会员后，客户可以完善个人资料、实名认证、管理（发布、修改、删除）信息、充值享受超值权限、签约推广等。客户注册会员，会获得零工在线免费赠送的10元钱的零工币（10个），在本站使用。
          </p>
      <p class="h1">常见问题</p>
      <p class="h2">发布和快速发布有什么不同？</p>
      <p class="h3">发布---客户需要在登录零工宝状态下，按照要求规范发布信息；</p>
      <p class="h3">快速发布---客户未注册为会员时，可以使用这个功能，免费体验，发布信息，但是一个联系手机号码只能快速发布一次。完成后，网站会自动生成一个会员账号，客户应及时登录零工宝完善信息资料。</p>
       <p class="h2">发布信息的数量有什么限制吗？</p>
      <p class="h3">目前零工在线对发布的信息数量没有限制。普通会员发布信息每条2个零工币，购买某种套餐的VIP会员发布信息是免费的。</p>
      <p class="h2">发布信息有什么规则？</p>
      <p class="h3">a、注册会员可以到零工宝（用户中心）界面，点击发布按钮按照提示操作。未注册会员的用户可以使用手机版界面，快速发布功能，快速发布是免费的，信息不分类，快速发布的信息展示在最新发布里面。</p>
      <p class="h3">b、客户发布的信息，凡是上传的图片及填写的文字性等内容都需要人工审核，含有敏感违禁词汇的信息无法成功发布。审核依据司法机关和网监部门等监管机构的法律法规，请不要发布违法信息，否则信息将无法展示或者会被删除。</p>
      <p class="h3">c、不允许重复发布信息，若有需要，客户可以使用“刷新”来代替发布。</p>
      <p class="h2">如何编辑已经发布的信息？</p>
      <p class="h3">客户可以到零工宝（用户中心）对已经发布的信息进行修改、刷新、删除等操作。</p>
      <p class="h2">如何管理我的账户？</p>
      <p class="h3">零工币是客户在零工在线平台使用服务时的支付形式，客户需要充值购买零工币，也可以通过参与零工在线的相应活动来获得零工币。1个零工币=1元人民币。客户需要到零工宝（用户中心）界面管理自己的账户，进行充值或消费，请严谨保密自己的会员名及密码。</p>
<p class="h2">用户如何对零工进行评价？</p>
      <p class="h3">评价是用户对零工提供的服务质量的意见表达，用户必须严格遵循实事求是的原则给予评价。用户可以通过某零工的详情页或网站首页上的评价按钮，进入评价页面操作。零工在线要求用户必须注册为会员后才能评价，同一用户一年内只允许评价同一位零工一次。如果用户有特殊要求，可以联系零工在线客服解决问题400-860-6286。</p>
      <p class="h1">其他问题</p>
      <p class="h2">零工在线网站上有哪些信息？</p>
      <p class="h3">零工在线网站，目前通过电脑版和手机版展示信息，信息主要分为零工的服务工种信息、企业或个人发布的招聘零工的信息两类。</p>
      <p class="h2">零工在线网站上的功能怎么理解？</p>
      <p class="h3">零工小参---是用户使用网站的帮助中心；</p>
      <p class="h3"> 零工宝----是注册会员管理其资料及发布信息的会员中心；</p>
      <p class="h3"> 最新发布---是客户在近期通过“发布”或者“快速发布”功能发布的信息。</p>
      <p class="h2">3、用户如何使用零工在线网站，收费吗？</p>
      <p class="h3">用户不需要注册会员，可以直接在网站上找到自己需要的零工服务信息。不收费。用户可以使用搜索功能，填写关键词，快速查找信息，也可以在首页上点击相应的服务工种，列表相关零工信息。</p>
      <p class="h1">隐私与安全</p>
      <p class="h2">客户的个人隐私信息安全吗？</p>
      <p class="h3">客户在零工在线网站进行实名认证，实名信息不予公开。详情参见 <a href="#">《零工在线用户协议》</a>了解零工在线的隐私与安全政策</p>
      <p class="h3">尊重用户个人隐私是零工在线的一项基本政策。所以，零工在线一定不会公开、编辑或透露用户的注册资料及保存在零工在线各项服务中的非公开内容，除非零工在线在诚信的基础上认为透露这些信息在以下几种情况是必要的：</p>
      <p class="h3">1. 遵守有关法律规定，包括在国家有关机关查询时，提供用户在零工在线的网页上发布的信息内容及其关联资料。</p>
      <p class="h3">2. 遵从零工在线服务程序。</p>
      <p class="h3">3. 在紧急情况下维护用户个人和社会大众的隐私等安全。</p>
      <p class="h3">4. 零工在线认为有必要的其他情况下。用户在此授权零工在线可以向其电子邮箱发送商业信息。</p>
      <p class="h3">零工在线含有对其他网站的链接。零工在线不对这些网站的内容及他们关于隐私权的行为负责。</p>
      <p class="h3">您一旦注册成功成为用户，您将得到一个密码和帐号（包括快速发布时自动生成的密码和账号）。如果您未保管好自己的帐号和密码而对您、零工在线或第三方造成的损害，您将负全部责任。另外，每个用户都要对其帐户中的所有活动和事件负全责。用户同意若发现任何非法使用用户帐号或安全漏洞的情况，立即通告零工在线。</p>
  </div>
</section>
<footer>
    <div class="main">
        <ul>
            <li><a href="#">法律声明 |</a></li>
            <li><a href="#">零工宝 |</a></li>
            <li><a href="#">零工小参 |</a></li>
            <li><a href="#">招贤纳士 |</a></li>
            <li><a href="#">关注微博</a></li>
        </ul>
        <p>Copyright © 2016 lg-zx.com Corporation, All Rights Reserved 鲁ICP备16012134号-1 站长统计</p>
    </div>
</footer>
</body>
<style>

</style>
</html>