<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <link rel="stylesheet" href="/static/css/common.css"/>
    <link rel="stylesheet" href="/static/css/head-foot.css"/>
    <link rel="stylesheet" href="/static/css/help.css"/>
    <title>用户协议</title>
</head>
<body>
<section>
    <div class="head">
        <img src="/static/images/LOGOa.png" alt=""/>
        <span>用户协议</span>
    </div>
</section>
<p class="line"></p>
<section>
    <div class="main" style="padding-left: 60px;;">
    <pre style="color: #333;font-size: 16px;line-height: 20px;">
   前言

      lg-zx.com既零工在线网（以下称“零工在线”）是一个网络分类信息网站。零工在线提供包括分类信息浏览、发布和电子公告板等服务。零工在
   线各项服务的所有权和运营权均属青岛零工在线信息技术有限公司所有。
     零工在线网上的信息是由用户注册后发布的，所有内容均由发布者对信息的真实性负责。鉴于会员在发布信息时可以不需要提供身份证件，零工在
   线无法对发布者的身份进行验证，故零工在线不对会员发布信息内容的真实性负责，但我们鼓励发布者进行实名认证，以提高自己的信誉度。

 版权声明
     零工在线网址的内容和图表受到中国版权法律、法规及相关国际条约的保护。零工在线拥有一切权利，未经零工在线同意，不允许任何单位或个人
 全部或部分复制、转载或以其他任何方式使用。禁止以任何目的使用零工在线网上的内容和图表。经零工在线同意后复制、转载或者以其他形式使用本
 网站相关资料的，应当标明资料来源于零工在线，以及零工在线或相关第三方拥有该等资料的著作权的字样。

 商标声明
     零工在线的商标，属于青岛零工在线信息技术服务有限公司所有。零工在线合作者的商标属于合作者
 所有。未经零工在线及/或零工在线合作者事先书面许可，不得复制或以任何其他方式使用前述商标。
 以下条款将作为用户在使用零工在线服务时应遵循的协议约定。
     用户应当在使用零工在线服务之前认真阅读本协议全部内容。如对本协议有任何疑问的，应向零工在线咨询。请用户务必审慎阅读、充分理解各条
 款内容，特别是免除或者限制责任的条款、争议解决条款。限制、免责条款、重点提示条款将以黑体加粗或加下划线的形式提示用户重点注意。无论用
 户是否在使用零工在线服务之前认真阅读了本协议内容，只要用户使用零工在线服务，包括但不限于发布信息，浏览信息，发布推广，均被视为用户已
 经阅读且接受本协议，本协议即产生约束力，届时用户不应以未阅读本协议内容为由，主张本协议无效，或主张撤销本协议。

1.定义
     会员，包含认证会员和非认证会员。认证会员是指通过 www.lg-zx.com 完成注册，并完善全部内容后，经过零工在线认证通过的会员。非认证
 会员指经过注册，未完善全部内容或未通过认证的会员。
     用户，包括会员、通过零工在线寻求服务的人员或组织及浏览网站人员。

2.用户协议的生效和修改
     本协议内容包括本协议正文，以及用户在使用零工在线会员服务时，可能会另有的单独协议等。所有零工在线已经发布的或将来可能发布的规则、
 协议、通知、公告、声明或其它类似内容，为本协议不可分割的组成部分，与本协议具有同等法律效力。如遇国家法律法规变更或零工在线产品和服务
 规则发生调整，零工在线有权根据需要不时地修改本协议，并以网站公示的方式进行公示，修改后的协议或规则于公示发布时生效，如用户不同意相关
 变更内容，请立即停止使用零工在线服务并通知零工在线。如果用户继续享用服务或未在合理的时间内通知零工在线，则视为无条件接受本协议条款
 的变动。如发生有关争议时，以零工在线最新的相关协议为准。
     零工在线拥有对本协议的最终解释权。

3.用户资格
     用户使用零工在线服务时应确认为具备相应民事行为能力的自然人、法人或其他组织。请用户注意：若用户为自然人的，零工在线仅向18周岁以上
  有完全民事行为能力人提供服务，请用户在使用前确认自己符合前述规定。
     若用户不具备前述主体资格，则用户及用户的监护人应承担因此导致的一切后果，零工在线不对此承担任何责任，并可无条件的注销该用户的账户
  。零工在线若因此而造成的损失，零工在线有权向该用户及用户监护人索偿。
     零工在线有权单方面无理由禁止某一用户使用零工在线服务。

4.用户账户
     用户完成注册程序时，零工在线会向用户提供唯一编号的零工在线账户，并由用户自行选择密码。零工在线识别特定用户的方式是且只是用户使用
  特定账户和与之匹配的密码登录。故用户应保证账户和密码的安全，并对通过账户和密码实施的行为负责。对于他人使用任何手段获取用户账户及其
  密码登录零工在线并实施任何的行为，零工在线都视为用户本人的行为，用户不得以该登录非其本人所为为理由要求零工在线对其负责。除非有法律
  规定且征得零工在线的同意，否则，用户账户和密码不得以任何方式转让、赠与或继承（与账户相关的财产权益除外）。

5.内容
     使用零工在线服务前，用户应理解零工在线提供的分类及站内的所有信息，包括其中包含的文字，图片，链接等（以下称“内容”）均由用户自行上
  传，并且承担全部责任，零工在线不对信息的真实性，准确性，有效性和安全性负责，用户在交易中发生的任何纠纷与零工在线无关。用户必须保证自
  己拥有所提供的信息的版权，或获得他人授权，并保证该信息不侵犯到任何第三人的合法权益；如用户违反本条规定造成零工在线被第三人索赔的，
  用户应全额承担零工在线一切损失(包括但不限于各种赔偿费、诉讼代理费及为此支出的其它合理费用)。同时当用户向零工在线提供内容时，用户即
  授予零工在线永久性的、全球的、不可撤销的、免使用费的、可再次授权给他人的使用权。用户必须自行评估和承担在零工在线上提供和使用内容而产
  生的一切风险、损失。 零工在线有权利单方面无理由删除任何免费信息。当有付费要求才发布的内容，在会员无续费的情况下，零工在线有权利暂停
  或撤销任何付费信息的发布。

 6.禁止
     用户应在适当的栏目或分类内发布、浏览或使用信息，不应做出任何法律法规禁止的行为。对于违反国家规定的《互联网违禁信息》的内容，零工
   在线一经发现，将会删除相关信息，注销账户，屏蔽IP地址、关键字、联系方式，或法律诉讼等。
     用户使用零工在线服务时，不得违背社会公共利益或公共道德，不得损害他人的合法权益，不得违反本协议及相关规则。如果用户违反前述约定，
   应自行承担所有法律后果，零工在线不负任何连带责任。
     用户违反本协议及相关规则时，零工在线有权终止对用户提供的零工在线服务，且无须征得用户同意或提前通知用户。
     对于用户在零工在线上的行为，零工在线有权单方认定用户行为是否构成对本协议及相关规则的违反，并据此采取相应处理措施。

 7.费用与服务
     零工在线是对大多数用户免费的分类信息网站，但针对零工在线的特定服务收费。若用户所使用的服务需支付费用，用户有权决定是否使用并接受
   该收费服务。
     零工在线上的收费服务以人民币计价，定价上可能随时调整。我们将以网站公告或注册提醒或邮件、短信的方式来通知用户收费政策的变更。用户
   在网站上消费时，系统默认以工分的方式进行，用户可以通过充值人民币的方式获取相应额度的工分。
     付费服务是在系统接收到用户的付款后才开始。请注意：付费服务功能一旦开始，用户不得以任何理由要求取消、终止服务或退款，若因用户个人
   行为（如:自行删除）或发布信息内容违反本协议相关要求（协议以付费实际发生时的协议为准）而被转移类目或被删除，零工在线将不予退款。
     零工在线因网站自身需要进行改版的，若涉及付费产品的实质性变化，包括但不限于产品取消、服务内容发生增加或减少、登载页面变更、发布城
   市变更的，零工在线有权提前单方终止服务并及时通知客户，将客户已付款但未履行服务部分款项退还客户，此类情况不视为零工在线违约，零工在
   线无需承担任何违约责任。

8.账户余额
     零工在线账户余额是零工在线内部使用的现金账户，方便用户进行付费产品的购买，或者享受更多的优惠。用户可以使用充值的方式增加零工在线
   账户的余额，同时零工在线也会通过活动的方式奖励一定的现金（工分）到用户的零工在线账户中。所有账户余额中的部分都仅限于在零工在线内部
   进行使用，不能提现或退款。

9.侵权通知
     用户发现零工在线上的任何内容不符合法律规定，不符合本用户协议规定时，用户有权利和义务通过点击“举报”链接向零工在线汇报。 当用户确
  认自己的个人信息被盗用，或者用户的版权或者其他权利被侵害，请将此情况报告给零工在线客服。
    零工在线会在核实后，根据相应法规予以配合处理。零工在线保留在用户提供的证据不尽充分详实或是难以与用户取得联系进一步核实时暂停处理
  侵权通知的权利。

10.免责
     鉴于零工在线仅作为用户网上发布信息的网络平台提供者，并非信息的发布者；用户上传的内容，没有经过零工在线事先审查，因此零工在线无法
  保证其内容的真实性、准确性、有效性和安全性。用户应确认在使用零工在线所提供的服务前，用户已经知晓，理解并认可此情况。用户同意不就其
  他用户发布的内容或所作所为追究零工在线的责任。
    用户如因为浏览零工在线的内容或第三方发布和上传的内容而因此遭受到任何损失，或与其他用户发生争议，就上述损失或争议或任何方面产生有
  关的索赔、要求、诉讼、损失和损害，用户同意免除零工在线及其关联公司、零工在线的管理层、董事、代理人和雇员的责任。
    零工在线对于用户由于使用零工在线而造成的任何金钱、商誉、名誉的损失，或任何特殊的、间接的、或结果性的损失都不负任何责任。用户同意
  就用户自身行为之合法性单独承担责任。
    对于零工在线为使用者提供便利而设置的外部链接网址，零工在线并不保证其准确性、安全性和完整性，亦并不代表本网站对其链接内容的认可，
  请使用者谨慎确认后使用，零工在线对由此导致的任何损失或伤害不承担任何责任。
    零工在线对由于政府禁令、现行生效的适用法律或法规的变更、火灾、地震、动乱、战争、停电、通讯线路中断、黑客攻击、计算机病毒侵入或发
  作、电信部门技术调整、因政府管制而造成网站的暂时性关闭等任何影响网络正常运营的不可预见、不可避免、不可克服和不可控制的事件（“不可抗
  力事件”），以及他人蓄意破坏、零工在线工作人员的疏忽或不当使用，正常的系统维护、系统升级，或者因网络拥塞而导致本网站不能访问而造成的
  本网站所提供的信息及数据的延误、停滞或错误，以及使用者由此受到的一切损失不承担任何责任。
    零工在线不能保证某一种职位描述会有一定数目的使用者来浏览，也不能保证会有一位特定的使用者来浏览。

11.隐私与保密：
     用户使用零工在线提供的任何服务包括但不限于发布信息，浏览信息，发布推广等将导致用户的IP地址为零工在线获得并在网页中显示作为用户的
  身份标识，同时零工在线将可能根据法律法规的规定向第三方提供该IP地址，用户应对此表示知情并认可。
    用户使用零工在线服务、参加零工在线活动、访问零工在线页或使用私信聊天时，零工在线自动接收并记录的用户浏览器传递给零工在线服务器的
  数据。但使用零工在线就意味着同意零工在线将用户发帖时使用的IP地址显示出来作为身份标识，即用户IP地址不受本隐私权政策保护；用户在网络
  上公开的其他个人信息亦不受此保护；
    零工在线不会向任何人出售或出借用户的个人信息，除非事先得到用户的许可；零工在线亦不允许任何第三方以任何手段收集、编辑、出售、传播
  或披露用户的个人信息。任何用户如从事上述活动，一经发现，零工在线将采取法律手段追究责任；
    为服务用户的目的，零工在线可能通过使用用户的个人信息，向用户提供服务，包括但不限于向用户发出产品和服务信息，或者与零工在线合作伙
  伴共享信息以便他们向用户发送有关其产品和服务的信息。
    用户的个人信息将在下述情况下部分或全部被披露：
    a.经用户同意，向第三方披露；
    b.如果用户是具备资格的知识产权投诉人并已提起投诉，应被投诉人要求而向被投诉人披露，以便双方处理可能的权利纠纷；
    c.根据法律的有关规定，或者行政、司法机构的要求，向第三方或者行政、司法机构披露；
    d.如果用户出现违反中国有关法律或者网站政策的情况而需要向第三方披露；
    e.为提供用户所要求的产品和服务，而必须和第三方分享用户的个人信息；
    f.其它零工在线依据法律或者网站政策认为合适的披露；
    g.在零工在线上创建的某一分类信息交易中，如交易任何一方履行或部分履行了交易义务并提出信息披露请求的，零工在线有权决定向该用户提供
    其交易对方的联络方式等必要信息，以促成交易的完成或纠纷的解决。
     在使用零工在线服务进行网上交易时，用户不可避免的要向交易对方或潜在的交易对方提供自己的个人信息，如联络方式或者邮政地址等。请用户
    妥善保护自己的个人信息，仅在必要的情形下向他人提供；若发生用户信息被泄露或盗用的情况，零工在线也提供诸如自动系统举报删帖、客服电
    话等服务配合用户的信息安全保护工作。
       —链接至其他网站，在赞助商推广或用户登录的信息中，或许会在零工在线网站中提供链接至零工在线以外的网站上。零工在线将不为其他网站
    的隐私权保护规定负责。

12．协议终止
    用户同意，零工在线基于平台服务的安全性，有权中止向您提供部分或全部零工在线平台服务，暂时冻结用户的账户，待安全问题解决后及时恢复，
    并对中止、冻结及恢复的事实及时通知。如果网站的安全问题是由用户的违法行为引起，零工在线有权终止向用户提供部分或全部平台服务，永久
    冻结（注销）用户的帐户，并有权向用户对损失进行索赔。
    用户同意，与零工在线的服务关系终止后，零工在线仍享有下列权利：
    a.继续保存用户未及时删除的注册信息及用户使用零工在线平台服务期间发布的所有信息至法律规定的记录保存期满。
    b.用户在使用零工在线平台服务期间存在违法行为或违反本服务和/或规则的行为的，零工在线仍可依据本服务向用户主张权利、追究责任。

13.争议解决
      本协议之订立、生效、解释、修订、补充、终止、执行与争议解决均适用中华人民共和国法律，如法律无相关规定的，则应参照通用国际商业惯例
    和（或）行业惯例。
     本协议任一条款被废止、无效或不可执行，该条应视为可分的且并不影响本协议其余条款的有效性及可执行性。
     因本协议产生之争议、纠纷，应由零工在线与用户协商解决；协商不成的，应以零工在线所属的青岛零工在线信息技术有限公司的住所地法院管辖。

        </pre>
    </div>

</section>
<footer>
    <div class="main">
        <ul>
            <li><a href="#">法律声明 |</a></li>
            <li><a href="#">零工宝 |</a></li>
            <li><a href="<?php echo site_url('help'); ?>">零工小参 |</a></li>
            <li><a href="#">招贤纳士 |</a></li>
            <li><a href="#">关注微博</a></li>
        </ul>
        <p>Copyright © 2016 lg-zx.com Corporation, All Rights Reserved 鲁ICP备16012134号-1 站长统计</p>
    </div>
</footer>
</body>
<style>

</style>
</html>