<!-- Content Wrapper. Contains page content d-->
    <div class="content-wrapper">
        <!-- Content Header (Page header) -->
        <section class="content-header">
            <h1>
                会员添加
            </h1>
            <ol class="breadcrumb">
                <li><a href="/admin"><i class="fa fa-dashboard"></i> 首页</a></li>
                <li><a href="/admin/addMember">会员添加</a></li>
            </ol>
        </section>
                    <div align="center">
                        <button onclick="cutover(this);" name="gongsi">打开添加公司用户</button>
                        <button onclick="cutover(this);" name="geren">打开添加个人用户</button>
                    </div>
                    <!-- /.box-header -->
                    <div class="box-body">
                        <div id="gongsi" align="center" style="width:600px; height:1300px; ">
                            <h3>公司用户</h3>
                                <form action="<?php echo site_url('admin/addMember'); ?>" method="post">
                                    <label for="username">用户名　:</label>
                                    <input type="text" name="username" id="username"/><br/><br/>
                                    
                                    <label for="password">密　码　:</label>
                                    <input type="password" name="password" id="password"/><br/><br/>
                                    
                                    <label for="province_id">省　份　:</label>
                                    <select  style="width:150px; height:26px;" name="p_id" class="province">
                                    </select>
                                    <br/><br/>
                                    
                                    <label for="c_id">城　市　:</label>
                                    <select onchange="join(this);" id="c_id" style="width:150px; height:26px;" name="c_id" class="city1">
                                    </select>
                                    <br/><br/>
                                    
                                    <label for="area">区　县　:</label>
                                    <select onchange="join(this);" name="arae" id="area" style="width:150px; height:26px;">
                                    </select>
                                    <br/><br/>

                                    <label for="street">街　道　:</label>
                                    <select id="street" name="street" style="width:150px; height:26px;">
                                    </select>
                                    <br/><br/>

                                    <label for="address">详细地址:</label>
                                    <input type="text" name="address" id="address"/><br/><br/>
                                    
                                    <label for="mobile">手　机　:</label>
                                    <input type="text" name="mobile" id="mobile"/><br/><br/>
                                    
                                    <label for="tel">固　话　:</label>
                                    <input type="text" name="tel" id="tel"/><br/><br/>
                                    
                                    <label for="email">邮　箱　:</label>
                                    <input type="text" name="email" id="email"/><br/><br/>
                                    
                                    <label for="qq">QQ　号　:</label>
                                    <input type="text" name="qq" id="qq"/><br/><br/>
                                    
                                    <label for="wechat">微信号　:</label>
                                    <input type="text" name="wechat" id="wechat"/><br/><br/>
                                    
                                    <label for="city_id">工　种　:</label>
                                    <select  style="width:150px; height:26px;" name="job_type">
                                        <?php foreach($job as $item): ?>
                                            <option value="<?= $item['id'] ?>"><?= $item['name'] ?></option>
                                        <?php endforeach; ?>
                                    </select>
                                    <br/><br/>

                                    <label for="coname">公司名称:</label>
                                    <input type="text" name="coname" id="coname"/><br/><br/>
                                    
                                    <label for="scale_code">公司规模:</label>
                                    <input type="text" name="scale_code" id="scale_code"/><br/><br/>
                                    
                                    <label for="weburl">公司网址:</label>
                                    <input type="text" name="weburl" id="weburl"/><br/><br/>
                                    
                                    <label for="idno" title="营业执照号">证件号　:</label>
                                    <input type="text" name="idno" id="idno"/><br/><br/>

                                    <label for="info1">服务标题:</label>
                                    <input type="text" name="info1" id="info1"/><br/><br/>

                                    <label for="info3">服务介绍:</label>
                                    <textarea style="resize:none" name="info3" id="info3" rows="6" cols="40"></textarea><br/><br/>

                                    <label for="info">公司简介:</label>
                                    <textarea style="resize:none" name="info" id="info" rows="6" cols="40"></textarea><br/><br/>

                                    <input type="hidden" name="is_co" value="gongsi"> 

                                    <input type="submit" value="提交"/>
                                </form>
                        </div>
                        <div id="geren" align="center" style="width:600px; height:1300px; display:none">
                            <h3>个人用户</h3>
                                <form action="<?php echo site_url('admin/addMember'); ?>" method="post">    
                                    <label for="username">用户名　:</label>
                                    <input type="text" name="username" id="username"/><br/><br/>
                                    
                                    <label for="password">密　码　:</label>
                                    <input type="password" name="password" id="password"/><br/><br/>
                                    
                                    <label for="province_id">省　份　:</label>
                                    <select  style="width:150px; height:26px;" name="p_id" class="province">
                                    </select>
                                    <br/><br/>
                                    
                                    <label for="c_id">城　市　:</label>
                                    <select onchange="join(this);" id="c_id" style="width:150px; height:26px;" name="c_id" class="city1">
                                    </select>
                                    <br/><br/>
                                    
                                    <label for="area">区　县　:</label>
                                    <select onchange="join(this);" name="arae" id="area" style="width:150px; height:26px;">
                                    </select>
                                    <br/><br/>

                                    <label for="street">街　道　:</label>
                                    <select id="street" name="street" style="width:150px; height:26px;">
                                    </select>
                                    <br/><br/>

                                    <label for="address">详细地址:</label>
                                    <input type="text" name="address" id="address"/><br/><br/>
                                    
                                    <label for="mobile">手　机　:</label>
                                    <input type="text" name="mobile" id="mobile"/><br/><br/>
                                    
                                    <label for="tel">固　话　:</label>
                                    <input type="text" name="tel" id="tel"/><br/><br/>
                                    
                                    <label for="email">邮　箱　:</label>
                                    <input type="text" name="email" id="email"/><br/><br/>
                                    
                                    <label for="qq">QQ　号　:</label>
                                    <input type="text" name="qq" id="qq"/><br/><br/>
                                    
                                    <label for="wechat">微信号　:</label>
                                    <input type="text" name="wechat" id="wechat"/><br/><br/>
                                    
                                    <label for="realname">真实姓名:</label>
                                    <input type="text" name="realname" id="realname"/><br/><br/>
                                    
                                    <label for="nickname">昵　称　:</label>
                                    <input type="text" name="nickname" id="nickname"/><br/><br/>
                                    
                                    <label for="sex">性　别　:</label>
                                    <select style="width:150px; height:26px;"  name="sex">
                                        <option value="1">男</option>
                                        <option value="2">女</option>
                                    </select>
                                    <br/><br/>
                                    
                                    <label for="link_address">证件号　:</label>
                                    <input type="text" name="link_address" id="link_address"/><br/><br/>
                                    
                                    <label for="city_id">工　种　:</label>
                                    <select  style="width:150px; height:26px;" name="job_type">
                                        <?php foreach($job as $item): ?>
                                            <option value="<?= $item['id'] ?>"><?= $item['name'] ?></option>
                                        <?php endforeach; ?>
                                    </select>
                                    <br/><br/>

                                    <label for="info1">服务标题:</label>
                                    <input type="text" name="info1" id="info1"/><br/><br/>

                                    <label for="info3">服务介绍:</label>
                                    <textarea style="resize:none" name="info3" id="info3" rows="6" cols="40"></textarea><br/><br/>

                                    <label for="info">个人简介:</label>
                                    <textarea style="resize:none" name="info" id="info" rows="6" cols="40"></textarea><br/><br/>

                                    <input type="hidden" name="is_co" value="geren"> 

                                    <input type="submit" value="提交"/>  
                                </form>
                        </div>
                    </div>
                    <!-- /.box-body -->

                </div>
                <!-- /.box -->

            </div>
            <!-- /.col -->
        </div>


        <!-- /.row -->
    </section>
    <!-- /.content -->
</div>
    <!-- /.content-wrapper -->


<!-- jQuery 2.2.3 -->
<script src="/static/daili/plugins/jQuery/jquery-2.2.3.min.js"></script>

<!-- Bootstrap 3.3.6 -->
<script src="/static/daili/bootstrap/js/bootstrap.min.js"></script>
<!-- Select2 -->
<script src="/static/daili/plugins/select2/select2.full.min.js"></script>
<!-- InputMask -->


<script src="/static/daili/plugins/input-mask/jquery.inputmask.js"></script>
<script src="/static/daili/plugins/input-mask/jquery.inputmask.date.extensions.js"></script>
<script src="/static/daili/plugins/input-mask/jquery.inputmask.extensions.js"></script>
<!-- date-range-picker -->

<script src="/static/daili/js/moment.min.js"></script>
<script src="/static/daili/plugins/daterangepicker/daterangepicker.js"></script>


<!-- bootstrap datepicker -->
<script src="/static/daili/plugins/datepicker/bootstrap-datepicker.js"></script>
<!-- bootstrap color picker -->
<script src="/static/daili/plugins/colorpicker/bootstrap-colorpicker.min.js"></script>

<!-- bootstrap time picker -->
<script src="/static/daili/plugins/timepicker/bootstrap-timepicker.min.js"></script>
<!-- SlimScroll 1.3.0 -->
<script src="/static/daili/plugins/slimScroll/jquery.slimscroll.min.js"></script>
<!-- iCheck 1.0.1 -->
<script src="/static/daili/plugins/iCheck/icheck.min.js"></script>
<!-- FastClick -->
<script src="/static/daili/plugins/fastclick/fastclick.js"></script>
<!-- AdminLTE App -->
<script src="/static/daili/dist/js/app.min.js"></script>
<!-- AdminLTE for demo purposes -->
<script src="/static/daili/dist/js/demo.js"></script>
<script src="/static/js/jquery.cxselect.min.js"></script>
<!-- Page script -->
<script>
    function cutover(obj){
        if(obj.name == 'gongsi'){
            document.getElementById('gongsi').style.display="block";
            document.getElementById('geren').style.display="none";
        }else if(obj.name == 'geren'){
            document.getElementById('gongsi').style.display="none";
            document.getElementById('geren').style.display="block";
        }
    }
    function join(obj){
        var grade = obj.options[obj.selectedIndex].value;
        var select;
        console.log(obj.name);
        $.get('<?php echo site_url('admin/getJoin'); ?>/'+grade,function(str){
            if(obj.name == 'c_id'){
                select = $("select#area");
            }else if(obj.name == 'arae'){
                select = $("select#street");
            }
            var data = eval('(' + str + ')');
            select.html('');
            select.append('<option>不限</option>');
            for(var i = 0 ; i < data.length ; i++){
                select.append('<option value="'+data[i]['id']+'">'+data[i]['name']+'</option>');
            }
        });
    }
    $('#gongsi').cxSelect({
        selects: ['province', 'city1'],
        required: true,
        jsonValue: 'v',
        jsonName: 'n',
        jsonSub: 's',
        data: [
            {'v': '45052', 'n': '北京', 's': [{'v': '1', 'n': '北京'}]},{'v': '45053', 'n': '天津', 's': [{'v': '2', 'n': '天津'}]},{'v': '3', 'n': '河北', 's': [{'v': '73', 'n': '石家庄'},{'v': '74', 'n': '唐山'},{'v': '75', 'n': '秦皇岛'},{'v': '76', 'n': '邯郸'},{'v': '77', 'n': '邢台'},{'v': '78', 'n': '保定'},{'v': '79', 'n': '张家口'},{'v': '80', 'n': '承德'},{'v': '83', 'n': '沧州'},{'v': '82', 'n': '廊坊'},{'v': '81', 'n': '衡水'}]},{'v': '4', 'n': '山西', 's': [{'v': '84', 'n': '太原'},{'v': '85', 'n': '大同'},{'v': '86', 'n': '阳泉'},{'v': '87', 'n': '长治'},{'v': '88', 'n': '晋城'},{'v': '89', 'n': '朔州'},{'v': '90', 'n': '晋中'},{'v': '91', 'n': '运城'},{'v': '92', 'n': '忻州'},{'v': '93', 'n': '临汾'},{'v': '94', 'n': '吕梁'}]},{'v': '5', 'n': '内蒙古', 's': [{'v': '95', 'n': '呼和浩特'},{'v': '96', 'n': '包头'},{'v': '97', 'n': '乌海'},{'v': '98', 'n': '赤峰'},{'v': '99', 'n': '通辽'},{'v': '100', 'n': '鄂尔多斯'},{'v': '101', 'n': '呼伦贝尔'},{'v': '102', 'n': '巴彦淖尔'},{'v': '103', 'n': '乌兰察布'},{'v': '104', 'n': '兴安'},{'v': '105', 'n': '锡林郭勒'},{'v': '106', 'n': '阿拉善'}]},{'v': '6', 'n': '辽宁', 's': [{'v': '111', 'n': '本溪'},{'v': '110', 'n': '抚顺'},{'v': '109', 'n': '鞍山'},{'v': '107', 'n': '沈阳'},{'v': '108', 'n': '大连'},{'v': '112', 'n': '丹东'},{'v': '113', 'n': '锦州'},{'v': '114', 'n': '营口'},{'v': '115', 'n': '阜新'},{'v': '116', 'n': '辽阳'},{'v': '117', 'n': '盘锦'},{'v': '118', 'n': '铁岭'},{'v': '119', 'n': '朝阳'},{'v': '120', 'n': '葫芦岛'}]},{'v': '7', 'n': '吉林', 's': [{'v': '121', 'n': '长春'},{'v': '122', 'n': '吉林'},{'v': '123', 'n': '四平'},{'v': '124', 'n': '辽源'},{'v': '125', 'n': '通化'},{'v': '126', 'n': '白山'},{'v': '127', 'n': '松原'},{'v': '128', 'n': '白城'},{'v': '129', 'n': '延边'}]},{'v': '8', 'n': '黑龙江', 's': [{'v': '130', 'n': '哈尔滨'},{'v': '131', 'n': '齐齐哈尔'},{'v': '132', 'n': '鸡西'},{'v': '133', 'n': '鹤岗'},{'v': '134', 'n': '双鸭山'},{'v': '135', 'n': '大庆'},{'v': '136', 'n': '伊春'},{'v': '137', 'n': '佳木斯'},{'v': '138', 'n': '七台河'},{'v': '139', 'n': '牡丹江'},{'v': '140', 'n': '黑河'},{'v': '141', 'n': '绥化'},{'v': '142', 'n': '大兴安岭'}]},{'v': '45054', 'n': '上海', 's': [{'v': '9', 'n': '上海'}]},{'v': '10', 'n': '江苏', 's': [{'v': '162', 'n': '南京'},{'v': '163', 'n': '无锡'},{'v': '164', 'n': '徐州'},{'v': '165', 'n': '常州'},{'v': '166', 'n': '苏州'},{'v': '167', 'n': '南通'},{'v': '168', 'n': '连云港'},{'v': '169', 'n': '淮安'},{'v': '170', 'n': '盐城'},{'v': '171', 'n': '扬州'},{'v': '172', 'n': '镇江'},{'v': '173', 'n': '泰州'},{'v': '174', 'n': '宿迁'}]},{'v': '11', 'n': '浙江', 's': [{'v': '175', 'n': '杭州'},{'v': '176', 'n': '宁波'},{'v': '177', 'n': '温州'},{'v': '178', 'n': '嘉兴'},{'v': '179', 'n': '湖州'},{'v': '180', 'n': '绍兴'},{'v': '183', 'n': '金华'},{'v': '182', 'n': '衢州'},{'v': '181', 'n': '舟山'},{'v': '184', 'n': '台州'},{'v': '185', 'n': '丽水'}]},{'v': '12', 'n': '安徽', 's': [{'v': '186', 'n': '合肥'},{'v': '187', 'n': '芜湖'},{'v': '188', 'n': '蚌埠'},{'v': '189', 'n': '淮南'},{'v': '190', 'n': '马鞍山'},{'v': '191', 'n': '淮北'},{'v': '192', 'n': '铜陵'},{'v': '193', 'n': '安庆'},{'v': '194', 'n': '黄山'},{'v': '195', 'n': '滁州'},{'v': '196', 'n': '阜阳'},{'v': '197', 'n': '宿州'},{'v': '199', 'n': '六安'},{'v': '200', 'n': '亳州'},{'v': '201', 'n': '池州'},{'v': '202', 'n': '宣城'}]},{'v': '13', 'n': '福建', 's': [{'v': '203', 'n': '福州'},{'v': '204', 'n': '厦门'},{'v': '205', 'n': '莆田'},{'v': '206', 'n': '三明'},{'v': '207', 'n': '泉州'},{'v': '208', 'n': '漳州'},{'v': '209', 'n': '南平'},{'v': '210', 'n': '龙岩'},{'v': '211', 'n': '宁德'}]},{'v': '14', 'n': '江西', 's': [{'v': '212', 'n': '南昌'},{'v': '213', 'n': '景德镇'},{'v': '214', 'n': '萍乡'},{'v': '215', 'n': '九江'},{'v': '216', 'n': '新余'},{'v': '217', 'n': '鹰潭'},{'v': '218', 'n': '赣州'},{'v': '219', 'n': '吉安'},{'v': '220', 'n': '宜春'},{'v': '221', 'n': '抚州'},{'v': '222', 'n': '上饶'}]},{'v': '15', 'n': '山东', 's': [{'v': '223', 'n': '济南'},{'v': '224', 'n': '青岛'},{'v': '225', 'n': '淄博'},{'v': '226', 'n': '枣庄'},{'v': '227', 'n': '东营'},{'v': '228', 'n': '烟台'},{'v': '229', 'n': '潍坊'},{'v': '230', 'n': '济宁'},{'v': '231', 'n': '泰安'},{'v': '232', 'n': '威海'},{'v': '233', 'n': '日照'},{'v': '234', 'n': '莱芜'},{'v': '235', 'n': '临沂'},{'v': '236', 'n': '德州'},{'v': '237', 'n': '聊城'},{'v': '238', 'n': '滨州'},{'v': '239', 'n': '菏泽'}]},{'v': '16', 'n': '河南', 's': [{'v': '240', 'n': '郑州'},{'v': '241', 'n': '开封'},{'v': '242', 'n': '洛阳'},{'v': '243', 'n': '平顶山'},{'v': '244', 'n': '安阳'},{'v': '245', 'n': '鹤壁'},{'v': '246', 'n': '新乡'},{'v': '247', 'n': '焦作'},{'v': '248', 'n': '濮阳'},{'v': '249', 'n': '许昌'},{'v': '250', 'n': '漯河'},{'v': '251', 'n': '三门峡'},{'v': '252', 'n': '南阳'},{'v': '253', 'n': '商丘'},{'v': '254', 'n': '信阳'},{'v': '255', 'n': '周口'},{'v': '256', 'n': '驻马店'},{'v': '257', 'n': '济源'}]},{'v': '17', 'n': '湖北', 's': [{'v': '258', 'n': '武汉'},{'v': '259', 'n': '黄石'},{'v': '260', 'n': '十堰'},{'v': '261', 'n': '宜昌'},{'v': '262', 'n': '襄阳'},{'v': '263', 'n': '鄂州'},{'v': '264', 'n': '荆门'},{'v': '265', 'n': '孝感'},{'v': '266', 'n': '荆州'},{'v': '267', 'n': '黄冈'},{'v': '268', 'n': '咸宁'},{'v': '269', 'n': '随州'},{'v': '270', 'n': '恩施'},{'v': '271', 'n': '仙桃'},{'v': '272', 'n': '潜江'},{'v': '273', 'n': '天门'},{'v': '274', 'n': '神农架'}]},{'v': '18', 'n': '湖南', 's': [{'v': '275', 'n': '长沙'},{'v': '276', 'n': '株洲'},{'v': '277', 'n': '湘潭'},{'v': '278', 'n': '衡阳'},{'v': '279', 'n': '邵阳'},{'v': '280', 'n': '岳阳'},{'v': '281', 'n': '常德'},{'v': '282', 'n': '张家界'},{'v': '283', 'n': '益阳'},{'v': '284', 'n': '郴州'},{'v': '285', 'n': '永州'},{'v': '286', 'n': '怀化'},{'v': '287', 'n': '娄底'},{'v': '288', 'n': '湘西'}]},{'v': '19', 'n': '广东', 's': [{'v': '289', 'n': '广州'},{'v': '290', 'n': '韶关'},{'v': '291', 'n': '深圳'},{'v': '292', 'n': '珠海'},{'v': '293', 'n': '汕头'},{'v': '294', 'n': '佛山'},{'v': '295', 'n': '江门'},{'v': '296', 'n': '湛江'},{'v': '297', 'n': '茂名'},{'v': '298', 'n': '肇庆'},{'v': '299', 'n': '惠州'},{'v': '300', 'n': '梅州'},{'v': '301', 'n': '汕尾'},{'v': '302', 'n': '河源'},{'v': '303', 'n': '阳江'},{'v': '304', 'n': '清远'},{'v': '305', 'n': '东莞'},{'v': '306', 'n': '中山'},{'v': '307', 'n': '潮州'},{'v': '308', 'n': '揭阳'},{'v': '309', 'n': '云浮'}]},{'v': '20', 'n': '广西', 's': [{'v': '310', 'n': '南宁'},{'v': '311', 'n': '柳州'},{'v': '312', 'n': '桂林'},{'v': '313', 'n': '梧州'},{'v': '314', 'n': '北海'},{'v': '315', 'n': '防城港'},{'v': '316', 'n': '钦州'},{'v': '317', 'n': '贵港'},{'v': '318', 'n': '玉林'},{'v': '319', 'n': '百色'},{'v': '320', 'n': '贺州'},{'v': '321', 'n': '河池'},{'v': '322', 'n': '来宾'},{'v': '323', 'n': '崇左'}]},{'v': '21', 'n': '海南', 's': [{'v': '45056', 'n': '三沙市'},{'v': '324', 'n': '海口市'},{'v': '325', 'n': '三亚市'},{'v': '328', 'n': '儋州市 '}]},{'v': '45055', 'n': '重庆', 's': [{'v': '22', 'n': '重庆'}]},{'v': '23', 'n': '四川', 's': [{'v': '385', 'n': '成都'},{'v': '386', 'n': '自贡'},{'v': '387', 'n': '攀枝花'},{'v': '388', 'n': '泸州'},{'v': '389', 'n': '德阳'},{'v': '390', 'n': '绵阳'},{'v': '391', 'n': '广元'},{'v': '392', 'n': '遂宁'},{'v': '393', 'n': '内江'},{'v': '394', 'n': '乐山'},{'v': '395', 'n': '南充'},{'v': '396', 'n': '眉山'},{'v': '397', 'n': '宜宾'},{'v': '398', 'n': '广安'},{'v': '399', 'n': '达州'},{'v': '400', 'n': '雅安'},{'v': '401', 'n': '巴中'},{'v': '402', 'n': '资阳'},{'v': '403', 'n': '阿坝'},{'v': '404', 'n': '甘孜'},{'v': '405', 'n': '凉山'}]},{'v': '24', 'n': '贵州', 's': [{'v': '406', 'n': '贵阳'},{'v': '407', 'n': '六盘水'},{'v': '408', 'n': '遵义'},{'v': '409', 'n': '安顺'},{'v': '412', 'n': '毕节'},{'v': '410', 'n': '铜仁'},{'v': '411', 'n': '黔西南'},{'v': '413', 'n': '黔东南'},{'v': '414', 'n': '黔南'}]},{'v': '25', 'n': '云南', 's': [{'v': '415', 'n': '昆明'},{'v': '416', 'n': '曲靖'},{'v': '417', 'n': '玉溪'},{'v': '418', 'n': '保山'},{'v': '419', 'n': '昭通'},{'v': '420', 'n': '丽江'},{'v': '421', 'n': '普洱'},{'v': '422', 'n': '临沧'},{'v': '423', 'n': '楚雄'},{'v': '424', 'n': '红河'},{'v': '425', 'n': '文山'},{'v': '426', 'n': '西双版纳'},{'v': '427', 'n': '大理'},{'v': '428', 'n': '德宏'},{'v': '429', 'n': '怒江'},{'v': '430', 'n': '迪庆'}]},{'v': '26', 'n': '西藏', 's': [{'v': '431', 'n': '拉萨'},{'v': '434', 'n': '日喀则'},{'v': '432', 'n': '昌都'},{'v': '433', 'n': '山南'},{'v': '435', 'n': '那曲'},{'v': '436', 'n': '阿里'},{'v': '437', 'n': '林芝'}]},{'v': '27', 'n': '陕西', 's': [{'v': '438', 'n': '西安'},{'v': '439', 'n': '铜川'},{'v': '440', 'n': '宝鸡'},{'v': '441', 'n': '咸阳'},{'v': '442', 'n': '渭南'},{'v': '443', 'n': '延安'},{'v': '444', 'n': '汉中'},{'v': '445', 'n': '榆林'},{'v': '446', 'n': '安康'},{'v': '447', 'n': '商洛'}]},{'v': '28', 'n': '甘肃', 's': [{'v': '448', 'n': '兰州'},{'v': '449', 'n': '嘉峪关'},{'v': '450', 'n': '金昌'},{'v': '451', 'n': '白银'},{'v': '452', 'n': '天水'},{'v': '453', 'n': '武威'},{'v': '454', 'n': '张掖'},{'v': '455', 'n': '平凉'},{'v': '456', 'n': '酒泉'},{'v': '457', 'n': '庆阳'},{'v': '458', 'n': '定西'},{'v': '459', 'n': '陇南'},{'v': '460', 'n': '临夏'},{'v': '461', 'n': '甘南'}]},{'v': '29', 'n': '青海', 's': [{'v': '462', 'n': '西宁'},{'v': '463', 'n': '海东'},{'v': '464', 'n': '海北'},{'v': '465', 'n': '黄南'},{'v': '466', 'n': '海南'},{'v': '467', 'n': '果洛'},{'v': '468', 'n': '玉树'},{'v': '469', 'n': '海西'}]},{'v': '30', 'n': '宁夏', 's': [{'v': '470', 'n': '银川'},{'v': '471', 'n': '石嘴山'},{'v': '472', 'n': '吴忠'},{'v': '473', 'n': '固原'},{'v': '474', 'n': '中卫'}]},{'v': '31', 'n': '新疆', 's': [{'v': '475', 'n': '乌鲁木齐'},{'v': '476', 'n': '克拉玛依'},{'v': '477', 'n': '吐鲁番'},{'v': '478', 'n': '哈密'},{'v': '479', 'n': '昌吉'},{'v': '480', 'n': '博尔塔拉'},{'v': '481', 'n': '巴音郭楞'},{'v': '482', 'n': '阿克苏'},{'v': '483', 'n': '克孜勒苏'},{'v': '484', 'n': '喀什'},{'v': '485', 'n': '和田'},{'v': '486', 'n': '伊犁'},{'v': '487', 'n': '塔城'},{'v': '488', 'n': '阿勒泰'}]},{'v': '32', 'n': '台湾', 's': []},{'v': '33', 'n': '香港', 's': []},{'v': '34', 'n': '澳门', 's': []}
        ]
    });
    $('#geren').cxSelect({
        selects: ['province', 'city1'],
        required: true,
        jsonValue: 'v',
        jsonName: 'n',
        jsonSub: 's',
        data: [
            {'v': '45052', 'n': '北京', 's': [{'v': '1', 'n': '北京'}]},{'v': '45053', 'n': '天津', 's': [{'v': '2', 'n': '天津'}]},{'v': '3', 'n': '河北', 's': [{'v': '73', 'n': '石家庄'},{'v': '74', 'n': '唐山'},{'v': '75', 'n': '秦皇岛'},{'v': '76', 'n': '邯郸'},{'v': '77', 'n': '邢台'},{'v': '78', 'n': '保定'},{'v': '79', 'n': '张家口'},{'v': '80', 'n': '承德'},{'v': '83', 'n': '沧州'},{'v': '82', 'n': '廊坊'},{'v': '81', 'n': '衡水'}]},{'v': '4', 'n': '山西', 's': [{'v': '84', 'n': '太原'},{'v': '85', 'n': '大同'},{'v': '86', 'n': '阳泉'},{'v': '87', 'n': '长治'},{'v': '88', 'n': '晋城'},{'v': '89', 'n': '朔州'},{'v': '90', 'n': '晋中'},{'v': '91', 'n': '运城'},{'v': '92', 'n': '忻州'},{'v': '93', 'n': '临汾'},{'v': '94', 'n': '吕梁'}]},{'v': '5', 'n': '内蒙古', 's': [{'v': '95', 'n': '呼和浩特'},{'v': '96', 'n': '包头'},{'v': '97', 'n': '乌海'},{'v': '98', 'n': '赤峰'},{'v': '99', 'n': '通辽'},{'v': '100', 'n': '鄂尔多斯'},{'v': '101', 'n': '呼伦贝尔'},{'v': '102', 'n': '巴彦淖尔'},{'v': '103', 'n': '乌兰察布'},{'v': '104', 'n': '兴安'},{'v': '105', 'n': '锡林郭勒'},{'v': '106', 'n': '阿拉善'}]},{'v': '6', 'n': '辽宁', 's': [{'v': '111', 'n': '本溪'},{'v': '110', 'n': '抚顺'},{'v': '109', 'n': '鞍山'},{'v': '107', 'n': '沈阳'},{'v': '108', 'n': '大连'},{'v': '112', 'n': '丹东'},{'v': '113', 'n': '锦州'},{'v': '114', 'n': '营口'},{'v': '115', 'n': '阜新'},{'v': '116', 'n': '辽阳'},{'v': '117', 'n': '盘锦'},{'v': '118', 'n': '铁岭'},{'v': '119', 'n': '朝阳'},{'v': '120', 'n': '葫芦岛'}]},{'v': '7', 'n': '吉林', 's': [{'v': '121', 'n': '长春'},{'v': '122', 'n': '吉林'},{'v': '123', 'n': '四平'},{'v': '124', 'n': '辽源'},{'v': '125', 'n': '通化'},{'v': '126', 'n': '白山'},{'v': '127', 'n': '松原'},{'v': '128', 'n': '白城'},{'v': '129', 'n': '延边'}]},{'v': '8', 'n': '黑龙江', 's': [{'v': '130', 'n': '哈尔滨'},{'v': '131', 'n': '齐齐哈尔'},{'v': '132', 'n': '鸡西'},{'v': '133', 'n': '鹤岗'},{'v': '134', 'n': '双鸭山'},{'v': '135', 'n': '大庆'},{'v': '136', 'n': '伊春'},{'v': '137', 'n': '佳木斯'},{'v': '138', 'n': '七台河'},{'v': '139', 'n': '牡丹江'},{'v': '140', 'n': '黑河'},{'v': '141', 'n': '绥化'},{'v': '142', 'n': '大兴安岭'}]},{'v': '45054', 'n': '上海', 's': [{'v': '9', 'n': '上海'}]},{'v': '10', 'n': '江苏', 's': [{'v': '162', 'n': '南京'},{'v': '163', 'n': '无锡'},{'v': '164', 'n': '徐州'},{'v': '165', 'n': '常州'},{'v': '166', 'n': '苏州'},{'v': '167', 'n': '南通'},{'v': '168', 'n': '连云港'},{'v': '169', 'n': '淮安'},{'v': '170', 'n': '盐城'},{'v': '171', 'n': '扬州'},{'v': '172', 'n': '镇江'},{'v': '173', 'n': '泰州'},{'v': '174', 'n': '宿迁'}]},{'v': '11', 'n': '浙江', 's': [{'v': '175', 'n': '杭州'},{'v': '176', 'n': '宁波'},{'v': '177', 'n': '温州'},{'v': '178', 'n': '嘉兴'},{'v': '179', 'n': '湖州'},{'v': '180', 'n': '绍兴'},{'v': '183', 'n': '金华'},{'v': '182', 'n': '衢州'},{'v': '181', 'n': '舟山'},{'v': '184', 'n': '台州'},{'v': '185', 'n': '丽水'}]},{'v': '12', 'n': '安徽', 's': [{'v': '186', 'n': '合肥'},{'v': '187', 'n': '芜湖'},{'v': '188', 'n': '蚌埠'},{'v': '189', 'n': '淮南'},{'v': '190', 'n': '马鞍山'},{'v': '191', 'n': '淮北'},{'v': '192', 'n': '铜陵'},{'v': '193', 'n': '安庆'},{'v': '194', 'n': '黄山'},{'v': '195', 'n': '滁州'},{'v': '196', 'n': '阜阳'},{'v': '197', 'n': '宿州'},{'v': '199', 'n': '六安'},{'v': '200', 'n': '亳州'},{'v': '201', 'n': '池州'},{'v': '202', 'n': '宣城'}]},{'v': '13', 'n': '福建', 's': [{'v': '203', 'n': '福州'},{'v': '204', 'n': '厦门'},{'v': '205', 'n': '莆田'},{'v': '206', 'n': '三明'},{'v': '207', 'n': '泉州'},{'v': '208', 'n': '漳州'},{'v': '209', 'n': '南平'},{'v': '210', 'n': '龙岩'},{'v': '211', 'n': '宁德'}]},{'v': '14', 'n': '江西', 's': [{'v': '212', 'n': '南昌'},{'v': '213', 'n': '景德镇'},{'v': '214', 'n': '萍乡'},{'v': '215', 'n': '九江'},{'v': '216', 'n': '新余'},{'v': '217', 'n': '鹰潭'},{'v': '218', 'n': '赣州'},{'v': '219', 'n': '吉安'},{'v': '220', 'n': '宜春'},{'v': '221', 'n': '抚州'},{'v': '222', 'n': '上饶'}]},{'v': '15', 'n': '山东', 's': [{'v': '223', 'n': '济南'},{'v': '224', 'n': '青岛'},{'v': '225', 'n': '淄博'},{'v': '226', 'n': '枣庄'},{'v': '227', 'n': '东营'},{'v': '228', 'n': '烟台'},{'v': '229', 'n': '潍坊'},{'v': '230', 'n': '济宁'},{'v': '231', 'n': '泰安'},{'v': '232', 'n': '威海'},{'v': '233', 'n': '日照'},{'v': '234', 'n': '莱芜'},{'v': '235', 'n': '临沂'},{'v': '236', 'n': '德州'},{'v': '237', 'n': '聊城'},{'v': '238', 'n': '滨州'},{'v': '239', 'n': '菏泽'}]},{'v': '16', 'n': '河南', 's': [{'v': '240', 'n': '郑州'},{'v': '241', 'n': '开封'},{'v': '242', 'n': '洛阳'},{'v': '243', 'n': '平顶山'},{'v': '244', 'n': '安阳'},{'v': '245', 'n': '鹤壁'},{'v': '246', 'n': '新乡'},{'v': '247', 'n': '焦作'},{'v': '248', 'n': '濮阳'},{'v': '249', 'n': '许昌'},{'v': '250', 'n': '漯河'},{'v': '251', 'n': '三门峡'},{'v': '252', 'n': '南阳'},{'v': '253', 'n': '商丘'},{'v': '254', 'n': '信阳'},{'v': '255', 'n': '周口'},{'v': '256', 'n': '驻马店'},{'v': '257', 'n': '济源'}]},{'v': '17', 'n': '湖北', 's': [{'v': '258', 'n': '武汉'},{'v': '259', 'n': '黄石'},{'v': '260', 'n': '十堰'},{'v': '261', 'n': '宜昌'},{'v': '262', 'n': '襄阳'},{'v': '263', 'n': '鄂州'},{'v': '264', 'n': '荆门'},{'v': '265', 'n': '孝感'},{'v': '266', 'n': '荆州'},{'v': '267', 'n': '黄冈'},{'v': '268', 'n': '咸宁'},{'v': '269', 'n': '随州'},{'v': '270', 'n': '恩施'},{'v': '271', 'n': '仙桃'},{'v': '272', 'n': '潜江'},{'v': '273', 'n': '天门'},{'v': '274', 'n': '神农架'}]},{'v': '18', 'n': '湖南', 's': [{'v': '275', 'n': '长沙'},{'v': '276', 'n': '株洲'},{'v': '277', 'n': '湘潭'},{'v': '278', 'n': '衡阳'},{'v': '279', 'n': '邵阳'},{'v': '280', 'n': '岳阳'},{'v': '281', 'n': '常德'},{'v': '282', 'n': '张家界'},{'v': '283', 'n': '益阳'},{'v': '284', 'n': '郴州'},{'v': '285', 'n': '永州'},{'v': '286', 'n': '怀化'},{'v': '287', 'n': '娄底'},{'v': '288', 'n': '湘西'}]},{'v': '19', 'n': '广东', 's': [{'v': '289', 'n': '广州'},{'v': '290', 'n': '韶关'},{'v': '291', 'n': '深圳'},{'v': '292', 'n': '珠海'},{'v': '293', 'n': '汕头'},{'v': '294', 'n': '佛山'},{'v': '295', 'n': '江门'},{'v': '296', 'n': '湛江'},{'v': '297', 'n': '茂名'},{'v': '298', 'n': '肇庆'},{'v': '299', 'n': '惠州'},{'v': '300', 'n': '梅州'},{'v': '301', 'n': '汕尾'},{'v': '302', 'n': '河源'},{'v': '303', 'n': '阳江'},{'v': '304', 'n': '清远'},{'v': '305', 'n': '东莞'},{'v': '306', 'n': '中山'},{'v': '307', 'n': '潮州'},{'v': '308', 'n': '揭阳'},{'v': '309', 'n': '云浮'}]},{'v': '20', 'n': '广西', 's': [{'v': '310', 'n': '南宁'},{'v': '311', 'n': '柳州'},{'v': '312', 'n': '桂林'},{'v': '313', 'n': '梧州'},{'v': '314', 'n': '北海'},{'v': '315', 'n': '防城港'},{'v': '316', 'n': '钦州'},{'v': '317', 'n': '贵港'},{'v': '318', 'n': '玉林'},{'v': '319', 'n': '百色'},{'v': '320', 'n': '贺州'},{'v': '321', 'n': '河池'},{'v': '322', 'n': '来宾'},{'v': '323', 'n': '崇左'}]},{'v': '21', 'n': '海南', 's': [{'v': '45056', 'n': '三沙市'},{'v': '324', 'n': '海口市'},{'v': '325', 'n': '三亚市'},{'v': '328', 'n': '儋州市 '}]},{'v': '45055', 'n': '重庆', 's': [{'v': '22', 'n': '重庆'}]},{'v': '23', 'n': '四川', 's': [{'v': '385', 'n': '成都'},{'v': '386', 'n': '自贡'},{'v': '387', 'n': '攀枝花'},{'v': '388', 'n': '泸州'},{'v': '389', 'n': '德阳'},{'v': '390', 'n': '绵阳'},{'v': '391', 'n': '广元'},{'v': '392', 'n': '遂宁'},{'v': '393', 'n': '内江'},{'v': '394', 'n': '乐山'},{'v': '395', 'n': '南充'},{'v': '396', 'n': '眉山'},{'v': '397', 'n': '宜宾'},{'v': '398', 'n': '广安'},{'v': '399', 'n': '达州'},{'v': '400', 'n': '雅安'},{'v': '401', 'n': '巴中'},{'v': '402', 'n': '资阳'},{'v': '403', 'n': '阿坝'},{'v': '404', 'n': '甘孜'},{'v': '405', 'n': '凉山'}]},{'v': '24', 'n': '贵州', 's': [{'v': '406', 'n': '贵阳'},{'v': '407', 'n': '六盘水'},{'v': '408', 'n': '遵义'},{'v': '409', 'n': '安顺'},{'v': '412', 'n': '毕节'},{'v': '410', 'n': '铜仁'},{'v': '411', 'n': '黔西南'},{'v': '413', 'n': '黔东南'},{'v': '414', 'n': '黔南'}]},{'v': '25', 'n': '云南', 's': [{'v': '415', 'n': '昆明'},{'v': '416', 'n': '曲靖'},{'v': '417', 'n': '玉溪'},{'v': '418', 'n': '保山'},{'v': '419', 'n': '昭通'},{'v': '420', 'n': '丽江'},{'v': '421', 'n': '普洱'},{'v': '422', 'n': '临沧'},{'v': '423', 'n': '楚雄'},{'v': '424', 'n': '红河'},{'v': '425', 'n': '文山'},{'v': '426', 'n': '西双版纳'},{'v': '427', 'n': '大理'},{'v': '428', 'n': '德宏'},{'v': '429', 'n': '怒江'},{'v': '430', 'n': '迪庆'}]},{'v': '26', 'n': '西藏', 's': [{'v': '431', 'n': '拉萨'},{'v': '434', 'n': '日喀则'},{'v': '432', 'n': '昌都'},{'v': '433', 'n': '山南'},{'v': '435', 'n': '那曲'},{'v': '436', 'n': '阿里'},{'v': '437', 'n': '林芝'}]},{'v': '27', 'n': '陕西', 's': [{'v': '438', 'n': '西安'},{'v': '439', 'n': '铜川'},{'v': '440', 'n': '宝鸡'},{'v': '441', 'n': '咸阳'},{'v': '442', 'n': '渭南'},{'v': '443', 'n': '延安'},{'v': '444', 'n': '汉中'},{'v': '445', 'n': '榆林'},{'v': '446', 'n': '安康'},{'v': '447', 'n': '商洛'}]},{'v': '28', 'n': '甘肃', 's': [{'v': '448', 'n': '兰州'},{'v': '449', 'n': '嘉峪关'},{'v': '450', 'n': '金昌'},{'v': '451', 'n': '白银'},{'v': '452', 'n': '天水'},{'v': '453', 'n': '武威'},{'v': '454', 'n': '张掖'},{'v': '455', 'n': '平凉'},{'v': '456', 'n': '酒泉'},{'v': '457', 'n': '庆阳'},{'v': '458', 'n': '定西'},{'v': '459', 'n': '陇南'},{'v': '460', 'n': '临夏'},{'v': '461', 'n': '甘南'}]},{'v': '29', 'n': '青海', 's': [{'v': '462', 'n': '西宁'},{'v': '463', 'n': '海东'},{'v': '464', 'n': '海北'},{'v': '465', 'n': '黄南'},{'v': '466', 'n': '海南'},{'v': '467', 'n': '果洛'},{'v': '468', 'n': '玉树'},{'v': '469', 'n': '海西'}]},{'v': '30', 'n': '宁夏', 's': [{'v': '470', 'n': '银川'},{'v': '471', 'n': '石嘴山'},{'v': '472', 'n': '吴忠'},{'v': '473', 'n': '固原'},{'v': '474', 'n': '中卫'}]},{'v': '31', 'n': '新疆', 's': [{'v': '475', 'n': '乌鲁木齐'},{'v': '476', 'n': '克拉玛依'},{'v': '477', 'n': '吐鲁番'},{'v': '478', 'n': '哈密'},{'v': '479', 'n': '昌吉'},{'v': '480', 'n': '博尔塔拉'},{'v': '481', 'n': '巴音郭楞'},{'v': '482', 'n': '阿克苏'},{'v': '483', 'n': '克孜勒苏'},{'v': '484', 'n': '喀什'},{'v': '485', 'n': '和田'},{'v': '486', 'n': '伊犁'},{'v': '487', 'n': '塔城'},{'v': '488', 'n': '阿勒泰'}]},{'v': '32', 'n': '台湾', 's': []},{'v': '33', 'n': '香港', 's': []},{'v': '34', 'n': '澳门', 's': []}
        ]
    });
</script>
</body>
</html>